Revit 2026 API

# FabricationNetworkChangeServiceSetMapOfSizesForStraights Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
```
```vb
Public Sub SetMapOfSizesForStraights (
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap)
)
```
```cpp
public:
void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
```
```fsharp
member SetMapOfSizesForStraights :
        fabricationPartSizeMaps : ISet<FabricationPartSizeMap> -> unit
```

#### Parameters

fabricationPartSizeMaps ISetFabricationPartSizeMap

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace